forums/admin/applications_addon/ips/nexus/sources/shipping/libs/fedex/PickupService_v3/CancelPickupRequest_FXF_v3.txt

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:q0="http://fedex.com/ws/pickup/v3" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <q0:CancelPickupRequest>
      <q0:WebAuthenticationDetail>
        <q0:UserCredential>
          <q0:Key></q0:Key>
          <q0:Password></q0:Password>
        </q0:UserCredential>
      </q0:WebAuthenticationDetail>
      <q0:ClientDetail>
        <q0:AccountNumber></q0:AccountNumber>
        <q0:MeterNumber></q0:MeterNumber>
      </q0:ClientDetail>
      <q0:TransactionDetail>
        <q0:CustomerTransactionId>Cancel Freight Pickup Example</q0:CustomerTransactionId>
      </q0:TransactionDetail>
      <q0:Version>
        <q0:ServiceId>disp</q0:ServiceId>
        <q0:Major>3</q0:Major>
        <q0:Intermediate>0</q0:Intermediate>
        <q0:Minor>0</q0:Minor>
      </q0:Version>
      <q0:CarrierCode>FXFR</q0:CarrierCode>
      <q0:PickupConfirmationNumber>20110721HRO279995</q0:PickupConfirmationNumber>
      <q0:ScheduledDate>2011-07-22</q0:ScheduledDate>
      <q0:Reason>TEST -- DO NOT DISPATCH</q0:Reason>
      <q0:ContactName>John Doe</q0:ContactName>
    </q0:CancelPickupRequest>
  </soapenv:Body>
</soapenv:Envelope>


